In [5]:
import matplotlib.pyplot as plt
from numpy import set_printoptions
from pandas import read_csv
import numpy as np
import pandas as pd

In [6]:
filename = 'residence.csv'
names = ['PID','HOUSE_NUM','CITY','OWN_OCCUP','NUM_BEDROOMS','NUM_BATHS','SW_FT']
data = read_csv(filename,names = names)

In [7]:
print("The entire data frame is")
data

The entire data frame is

      PID  HOUSE_NUM           CITY OWN_OCCUP NUM_BEDROOMS  NUM_BATHS   SW_FT
0  3425.0      104.0      Bangalore         Y            3        1.0  1000.0
1  6758.0      197.0       NewDelhi         N            3        1.5     NaN
2  2333.0        NaN         Jaipur         N          NaN        1.0   850.0
3  4545.0      201.0         Hassan       NaN            1        NaN   700.0
4     NaN      203.0  Vishakapatnam         Y            3        2.0  1600.0
5  7877.0      207.0         Meerut         Y          NaN        1.0   800.0
6  9897.0        NaN        Madurai       NaN            2        NaN   950.0
7  9291.0      213.0     Chandigarh         Y            1        1.0     NaN
8  4532.0      215.0        Calicut         Y           na        2.0  1800.0

In [8]:
shape = data.shape
print("The dimenstions of the dataframe are",shape)

The dimenstions of the dataframe are (9, 7)

In [32]:
types = data.dtypes
print("The data types of the columns are")
print(types)

The data types of the columns are
PID             float64
HOUSE_NUM       float64
CITY             object
OWN_OCCUP        object
NUM_BEDROOMS     object
NUM_BATHS       float64
SW_FT           float64
dtype: object

In [33]:
print()
print("The top n items of the dataset are")
data.head()

The top n items of the dataset are

      PID  HOUSE_NUM           CITY OWN_OCCUP NUM_BEDROOMS  NUM_BATHS   SW_FT
0  3425.0      104.0      Bangalore         Y            3        1.0  1000.0
1  6758.0      197.0       NewDelhi         N            3        1.5     NaN
2  2333.0        NaN         Jaipur         N          NaN        1.0   850.0
3  4545.0      201.0         Hassan       NaN            1        NaN   700.0
4     NaN      203.0  Vishakapatnam         Y            3        2.0  1600.0

In [66]:
s = pd.Series([0, 1, 2, 3, 4])
s.replace(0, 5)

0    5
1    1
2    2
3    3
4    4
dtype: int64

In [68]:
df = pd.DataFrame({'A': [0, 1, 2, 3, 4],
                   'B': [5, 6, 7, 8, 9],
                   'C': ['a', 'b', 'c', 'd', 'e']})
df

   A  B  C
0  0  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [69]:
df.replace(0, 5)

   A  B  C
0  5  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [70]:
df.replace([0, 1, 2, 3], 4)

   A  B  C
0  4  5  a
1  4  6  b
2  4  7  c
3  4  8  d
4  4  9  e

In [71]:
df.replace([0, 1, 2, 3], [4, 3, 2, 1])

   A  B  C
0  4  5  a
1  3  6  b
2  2  7  c
3  1  8  d
4  4  9  e

In [72]:
s.replace([1, 2], method='bfill')

0    0
1    3
2    3
3    3
4    4
dtype: int64

In [80]:
df

   A  B  C
0  0  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [81]:
df.replace([1, 2], method='bfill')

   A  B  C
0  0  5  a
1  3  6  b
2  3  7  c
3  3  8  d
4  4  9  e

In [79]:
df.replace({0: 10, 1: 100})

     A  B  C
0   10  5  a
1  100  6  b
2    2  7  c
3    3  8  d
4    4  9  e

In [89]:
df.replace({'A': 0, 'B': 5})

   A  B  C
0  0  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [90]:
df.replace({'A': {0: 100, 4: 400}})

     A  B  C
0  100  5  a
1    1  6  b
2    2  7  c
3    3  8  d
4  400  9  e

In [91]:
df

   A  B  C
0  0  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [99]:
df.replace({'B': {5: 100, 8: 400}})

   A    B  C
0  0  100  a
1  1    6  b
2  2    7  c
3  3  400  d
4  4    9  e

In [12]:
df = pd.DataFrame({'A': ['bat', 'foo', 'bait'],
                   'B': ['abc', 'bar', 'xyz']})
df

      A    B
0   bat  abc
1   foo  bar
2  bait  xyz

In [15]:
df.replace(to_replace=r'^b$', value='new', regex=False)

      A    B
0   bat  abc
1   foo  bar
2  bait  xyz

In [16]:
df

      A    B
0   bat  abc
1   foo  bar
2  bait  xyz

In [27]:
df.replace({r'ba*'}, {'new'}, regex=True)

       A      B
0   newt  anewc
1    foo   newr
2  newit    xyz

In [19]:
df

      A    B
0   bat  abc
1   foo  bar
2  bait  xyz

In [20]:
df.replace(regex={r'^ba.$': 'new', 'foo': 'xyz'})

      A    B
0   new  abc
1   xyz  new
2  bait  xyz